# Rebar Bend Data Crank Straight Length 0 Property

Source: https://www.revitapidocs.com/2026/a3e190e9-e199-dd29-ff83-e45a28bec5c1.htm

---

| Rebar Bend Data Crank Straight Length 0 Property |
| --- |

Identifies the crank straight length at the start.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankStraightLength0 { get; }
```

```
Public ReadOnly Property CrankStraightLength0 As Double
	Get
```

```
public:
property double CrankStraightLength0 {
	double get ();
}
```

```
member CrankStraightLength0 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace